Revit 2024 API
DisciplineTypeId.Hvac Property
 HVAC.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public static ForgeTypeId Hvac { get; }
Visual Basic
Public Shared ReadOnly Property Hvac As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ Hvac {
	ForgeTypeId^ get ();
}
See Also
DisciplineTypeId Class
Autodesk.Revit.DB Namespace